[
    {
      "id": 1,
      "customer_name": "Emily Johnson",
      "rating": 4.8,
      "feedback_text": "I had an amazing stay at Luxury Haven Hotel. The staff was incredibly welcoming, and the room was spacious and luxurious. The only minor issue was a slow Wi-Fi connection."
    },
    {
      "id": 2,
      "customer_name": "Michael Parker",
      "rating": 5,
      "feedback_text": "Seaside Retreat Resort exceeded my expectations. The beachfront view from my room was breathtaking, and the service was impeccable. I can't wait to return!"
    },
    {
      "id": 3,
      "customer_name": "Sophia Chen",
      "rating": 4.5,
      "feedback_text": "I enjoyed my stay at Downtown Suites. The location was convenient, and the room was clean and comfortable. The only drawback was limited parking space."
    },
    {
      "id": 4,
      "customer_name": "Alex Turner",
      "rating": 4.7,
      "feedback_text": "Mountain Lodge Inn offered a serene escape. The mountain views were breathtaking, and the cozy atmosphere made it a perfect getaway. The breakfast options could be more diverse."
    },
    {
      "id": 5,
      "customer_name": "Olivia Smith",
      "rating": 4.9,
      "feedback_text": "Urban Oasis Hotel was a true oasis of relaxation. The amenities were top-notch, and the spa was heavenly. The only suggestion would be to have more vegetarian dining options."
    },
    {
      "id": 6,
      "customer_name": "William Garcia",
      "rating": 4.6,
      "feedback_text": "I appreciated the historical ambiance of Cultural Heritage Inn. The decor was captivating, and the staff was knowledgeable. It would be great to have more modern amenities."
    },
    {
      "id": 7,
      "customer_name": "Sophie Martin",
      "rating": 4.8,
      "feedback_text": "Gastronome Suites delighted my taste buds. The restaurant's culinary creations were exceptional, and the presentation was artful. The service, however, had slight delays."
    },
    {
      "id": 8,
      "customer_name": "David Thompson",
      "rating": 4.7,
      "feedback_text": "Family Fun Resort was a hit with my kids. The activities kept them entertained, and the family-friendly environment was perfect. More variety in dining would make it even better."
    },
    {
      "id": 9,
      "customer_name": "Ava Rodriguez",
      "rating": 4.9,
      "feedback_text": "Modern Comforts Inn truly lived up to its name. The room's tech features were convenient, and the bed was incredibly comfortable. A USB charging port next to the bed would be handy."
    },
    {
      "id": 10,
      "customer_name": "Daniel Lee",
      "rating": 4.6,
      "feedback_text": "Efficient Business Hotel had the amenities I needed for my work trip. The meeting facilities were well-equipped, and the location was ideal. Some noise from the nearby road was noticeable."
    }
  ]